app/controllers/courses_controller.rb

SELECT * FROM "courses"
---
  def index
    @courses = Course.all #@current_user.courses

SELECT * FROM "courses" WHERE ("courses"."id" = 2)
---
  def edit
    @course = Course.find_by_param(params[:id])
    @departments = Department.find(:all, :order => 'name').map { |c| [c.name, c.id] }
    @years = Course.year_limits
    @days = @course.days.each_char.map { |c| c == c.upcase }

INSERT INTO "courses" ("number", "name", "created_at", "short_title", "title", "days", "term", "updated_at", "points_possible", "year", "description", "department") VALUES('162', 'Software Engineering', '2010-11-02 09:21:11', NULL, NULL, 'smTwRfs', 'Fall', '2010-11-02 09:21:11', NULL, 2010, '', 'COMPSCI')
---
  def create
    params[:course][:days] = "#{(params[:M] || 'm')}
                              #{(params[:Tu] || 't')}
                              #{(params[:W] || 'w')}
                              #{(params[:Th] || 't')}
                              #{(params[:F] || 'f')}
                              #{(params[:Sa] || 's')}
                              #{(params[:Su] || 's')}"
    if params[:department] # params[:course][:department_id].nil?
      params[:course][:department_id] = params[:department][:name]
    end
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "updated_at" = '2010-11-02 19:42:37', "term" = 'Fall', "days" = 'smTwRfs', "name" = 'Software Engineering', "number" = '169', "year" = 2010 WHERE "id" = 2
---
  def update
    params[:course][:days] = "#{(params[:M] || 'm')}
                              #{(params[:Tu] || 't')}
                              #{(params[:W] || 'w')}
                              #{(params[:Th] || 't')}
                              #{(params[:F] || 'f')}
                              #{(params[:Sa] || 's')}
                              #{(params[:Su] || 's')}"
    @course = Course.find_by_param(params[:id])
    respond_to do |format|
      if @course.update_attributes(params[:course])