app/controllers/items_controller.rb

SELECT * FROM "items" WHERE ("items"."course_id" = '1')
---
  def index
    @category = params[:category]
    if @category
      @category_s = Item.categories_s(@category)
      @items = @course.items.find(:all, :conditions => ["lower(category) IN (?)", @category.downcase.split(' ')])