app/controllers/main_controller.rb

  def index
    @current_user = current_user
    @user_session = UserSession.new
    if @current_user
      @courses = @current_user.courses
      course_ids = @courses.map {|c| c.id}
---
SELECT * FROM "courses" INNER JOIN "courses_users" ON "courses".id = "courses_users".course_id WHERE ("courses_users".user_id = 2 )