app/controllers/posts_controller.rb

  def index
    @all_tags = (@item.posts.map {|i| i.tags_array}).flatten.uniq.sort
---
SELECT * FROM "posts" WHERE ("posts".user_id = 1)

  def show
    @post = @item.posts.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2 AND ("posts".user_id = 1))

  def edit
    @post = @current_user.posts.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2 AND ("posts".user_id = 1))

  def create
    # maybe should separated into def create_post_reply
    # maybe parent_id should be added after save instead of before ...
    params[:post][:item_id] = @item.id
    params[:post][:body] = ActionController::Base.helpers.sanitize(params[:post][:body], :attributes => 'abbr alt cite datetime height href name src title width rowspan colspan rel')
    #regex = Regexp.new '((https?:\/\/|www\.)([-\w\.]+)+(:\d+)?(\/([\w\/_\.]*(\?\S+)?)?)?)'
    #params[:post][:body].gsub!(regex, '<a href="\1" rel="nofollow">\1</a>')
    @post = @current_user.posts.build(params[:post])
    #@post.item = @item
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "title", "body", "updated_at", "commented_at", "tags", "user_id") VALUES('2010-11-02 08:14:12', 'Testing', 'LOLOL', '2010-11-02 08:14:12', '2010-11-02 08:13:00', '', NULL)

  def update
    @post = @current_user.posts.find(params[:id])
    append = ActionController::Base.helpers.sanitize(params[:append], :attributes => 'abbr alt cite datetime height href name src title width rowspan colspan rel')
    #regex = Regexp.new '((https?:\/\/|www\.)([-\w\.]+)+(:\d+)?(\/([\w\/_\.]*(\?\S+)?)?)?)'
    #append.gsub!(regex, '<a href="\1" rel="nofollow">\1</a>')
  if !append.blank?
      params[:post][:body] = "#{@post.body}<br /><br /><span class='post_edit'>Edit (#{DateTime.now.strftime("%x")}, #{DateTime.now.strftime("%l:%M %p")}): </span><br />#{append}"
    end
    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2 AND ("posts".user_id = 1))
UPDATE "posts" SET "updated_at" = '2010-11-02 08:22:52', "title" = 'TestingLLL', "tags" = 'Tag2' WHERE "id" = 2

  def destroy
    @post = @current_user.posts.find(params[:id]) #Post.find(params[:id])
    @post.destroy
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2 AND ("posts".user_id = 1))
DELETE FROM "posts" WHERE "id" = 2