app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "last_name", "persistence_token", "first_name", "email") VALUES('2010-10-30 09:56:10', '572efc059652cfc7b657739146462e59ac9d5889843c83722c95378a530264425672a6af04bd0f3f645d8f4131162ebc46ee1fa72708190cc89273ea6498c604', '2010-10-30 09:56:10', 'kwliou', '4jZgJXicadrooSTk4MPJ', 'Liou', 'caf890490bf2755c061a75ef58d031629e9e0463dc7ea7fb6c0e1672def1d10e8ba66862563817c1e34eb40cbaf94c6aefce51e34cd41bcd45fade19dadb428c', 'Kevin', 'kwliou@gmail.com')
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save